RT-Thread/rt-thread/bsp/efm32/Libraries/efm32lib/src/efm32_lesense.c
/***************************************************************************//**
 * @file
 * @brief Low Energy Sensor (LESENSE) Peripheral API for EFM32 TG/GG devices.
 * @author Energy Micro AS
 * @version 2.0.0
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2011 Energy Micro AS, http://www.energymicro.com</b>
 *******************************************************************************
 *
 * This source code is the property of Energy Micro AS. The source and compiled
 * code may only be used on Energy Micro "EFM32" microcontrollers.
 *
 * This copyright notice may not be removed from the source code nor changed.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Energy Micro AS has no
 * obligation to support this Software. Energy Micro AS is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Energy Micro AS will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/
#include "efm32_lesense.h"
#if defined(LESENSE_COUNT) && (LESENSE_COUNT > 0)
#include "efm32_assert.h"
#include "efm32_bitband.h"
#include "efm32_cmu.h"

/***************************************************************************//**
 * @addtogroup EFM32_Library
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup LESENSE
 * @brief Low Energy Sensor (LESENSE) Peripheral API for EFM32TG/GG
 * @{
 ******************************************************************************/

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/


/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Initialize the LESENSE module.
 *
 * @details
 *   This function configures the main parameters of the LESENSE interface.
 *   Please refer to the initialization parameter type definition
 *   (LESENSE_Init_TypeDef) for more details.
 *
 * @note
 *   LESENSE_Init() has been designed for initializing LESENSE once in an
 *   operation cycle. Be aware of the effects of reconfiguration if using this
 *   function from multiple sources in your code. This function has not been
 *   designed to be re-entrant.
 *   Requesting reset by setting @p reqReset to true is required in each reset
 *   or power-on cycle in order to configure the default values of the RAM
 *   mapped LESENSE registers.
 *   Notice that GPIO pins used by the LESENSE module must be properly
 *   configured by the user explicitly, in order for the LESENSE to work as
 *   intended.
 *   (When configuring pins, one should remember to consider the sequence of
 *   configuration, in order to avoid unintended pulses/glitches on output
 *   pins.)
 *
 * @param[in] init
 *   LESENSE initialization structure.
 *
 * @param[in] reqReset
 *   Request to call LESENSE_Reset() first in order to initialize all LESENSE
 *   registers with the default value.
 ******************************************************************************/
void LESENSE_Init(LESENSE_Init_TypeDef const *init, bool const reqReset)
{
  /* Sanity check of initialization values */
  EFM_ASSERT((uint32_t)init->timeCtrl.startDelay < 4U);
  EFM_ASSERT((uint32_t)init->perCtrl.dacPresc < 32U);

  /* Reset LESENSE registers if requested. */
  if (reqReset)
  {
    LESENSE_Reset();
  }

  /* Set sensor start delay for each channel. */
  LESENSE_StartDelaySet((uint32_t)init->timeCtrl.startDelay);

  /* LESENSE core control configuration.
   * Set PRS source, SCANCONF register usage strategy, interrupt and
   * DMA trigger level condition, DMA wakeup condition, bias mode,
   * enable/disable to sample both ACMPs simultaneously, enable/disable to store
   * SCANRES in CNT_RES after each scan, enable/disable to always write to the
   * result buffer, even if it is full, enable/disable LESENSE running in debug
   * mode. */
  LESENSE->CTRL = ((uint32_t)init->coreCtrl.prsSel <<
                   _LESENSE_CTRL_PRSSEL_SHIFT) |
                  (uint32_t)init->coreCtrl.scanConfSel |
                  (uint32_t)init->coreCtrl.bufTrigLevel |
                  (uint32_t)init->coreCtrl.wakeupOnDMA |
                  ((uint32_t)init->coreCtrl.invACMP0 <<
                   _LESENSE_CTRL_ACMP0INV_SHIFT) |
                  ((uint32_t)init->coreCtrl.invACMP1 <<
                   _LESENSE_CTRL_ACMP1INV_SHIFT) |
                  ((uint32_t)init->coreCtrl.dualSample <<
                   _LESENSE_CTRL_DUALSAMPLE_SHIFT) |
                  ((uint32_t)init->coreCtrl.storeScanRes <<
                   _LESENSE_CTRL_STRSCANRES_SHIFT) |
                  ((uint32_t)init->coreCtrl.bufOverWr <<
                   _LESENSE_CTRL_BUFOW_SHIFT) |
                  ((uint32_t)init->coreCtrl.debugRun <<
                   _LESENSE_CTRL_DEBUGRUN_SHIFT);

  /* Set scan mode in the CTRL register using the provided function, don't
   * start scanning immediately. */
  LESENSE_ScanModeSet((LESENSE_ScanMode_TypeDef)init->coreCtrl.scanStart, false);

  /* LESENSE peripheral control configuration.
   * Set DAC0 and DAC1 data source, conversion mode, output mode. Set DAC
   * prescaler and reference. Set ACMP0 and ACMP1 control mode. Set ACMP and DAC
   * duty cycle (warm up) mode. */
  LESENSE->PERCTRL = ((uint32_t)init->perCtrl.dacCh0Data <<
                      _LESENSE_PERCTRL_DACCH0DATA_SHIFT) |
                     ((uint32_t)init->perCtrl.dacCh0ConvMode <<
                      _LESENSE_PERCTRL_DACCH0CONV_SHIFT) |
                     ((uint32_t)init->perCtrl.dacCh0OutMode <<
                      _LESENSE_PERCTRL_DACCH0OUT_SHIFT) |
                     ((uint32_t)init->perCtrl.dacCh1Data <<
                      _LESENSE_PERCTRL_DACCH1DATA_SHIFT) |
                     ((uint32_t)init->perCtrl.dacCh1ConvMode <<
                      _LESENSE_PERCTRL_DACCH1CONV_SHIFT) |
                     ((uint32_t)init->perCtrl.dacCh1OutMode <<
                      _LESENSE_PERCTRL_DACCH1OUT_SHIFT) |
                     ((uint32_t)init->perCtrl.dacPresc <<
                      _LESENSE_PERCTRL_DACPRESC_SHIFT) |
                     (uint32_t)init->perCtrl.dacRef |
                     ((uint32_t)init->perCtrl.acmp0Mode <<
                      _LESENSE_PERCTRL_ACMP0MODE_SHIFT) |
                     ((uint32_t)init->perCtrl.acmp1Mode <<
                      _LESENSE_PERCTRL_ACMP1MODE_SHIFT) |
                     (uint32_t)init->perCtrl.warmupMode;

  /* LESENSE decoder general control configuration.
   * Set decoder input source, select PRS input for decoder bits.
   * Enable/disable the decoder to check the present state.
   * Enable/disable decoder to channel interrupt mapping.
   * Enable/disable decoder hysteresis on PRS output.
   * Enable/disable decoder hysteresis on count events.
   * Enable/disable decoder hysteresis on interrupt requests.
   * Enable/disable count mode on LESPRS0 and LESPRS1. */
  LESENSE->DECCTRL = (uint32_t)init->decCtrl.decInput |
                     ((uint32_t)init->decCtrl.prsChSel0 <<
                      _LESENSE_DECCTRL_PRSSEL0_SHIFT) |
                     ((uint32_t)init->decCtrl.prsChSel1 <<
                      _LESENSE_DECCTRL_PRSSEL1_SHIFT) |
                     ((uint32_t)init->decCtrl.prsChSel2 <<
                      _LESENSE_DECCTRL_PRSSEL2_SHIFT) |
                     ((uint32_t)init->decCtrl.prsChSel3 <<
                      _LESENSE_DECCTRL_PRSSEL3_SHIFT) |
                     ((uint32_t)init->decCtrl.chkState <<
                      _LESENSE_DECCTRL_ERRCHK_SHIFT) |
                     ((uint32_t)init->decCtrl.intMap <<
                      _LESENSE_DECCTRL_INTMAP_SHIFT) |
                     ((uint32_t)init->decCtrl.hystPRS0 <<
                      _LESENSE_DECCTRL_HYSTPRS0_SHIFT) |
                     ((uint32_t)init->decCtrl.hystPRS1 <<
                      _LESENSE_DECCTRL_HYSTPRS1_SHIFT) |
                     ((uint32_t)init->decCtrl.hystPRS2 <<
                      _LESENSE_DECCTRL_HYSTPRS2_SHIFT) |
                     ((uint32_t)init->decCtrl.hystIRQ <<
                      _LESENSE_DECCTRL_HYSTIRQ_SHIFT) |
                     ((uint32_t)init->decCtrl.prsCount <<
                      _LESENSE_DECCTRL_PRSCNT_SHIFT);

  /* Set initial LESENSE decoder state. */
  LESENSE_DecoderStateSet((uint32_t)init->decCtrl.initState);

  /* LESENSE bias control configuration. */
  LESENSE->BIASCTRL = (uint32_t)init->coreCtrl.biasMode;
}


/***************************************************************************//**
 * @brief
 *   Set scan frequency for periodic scanning.
 *
 * @details
 *   This function only applies to LESENSE if period counter is being used as
 *   a trigger for scan start.
 *   The calculation is based on the following formula:
 *   Fscan = LFACLKles / ((1+PCTOP)*2^PCPRESC)
 *
 * @note
 *   Note that the calculation does not necessarily result in the requested
 *   scan frequency due to integer division. Check the return value for the
 *   resulted scan frequency.
 *
 * @param[in] refFreq
 *   Select reference LFACLK clock frequency in Hz. If set to 0, the current
 *   clock frequency is being used as a reference.
 *
 * @param[in] scanFreq
 *   Set the desired scan frequency in Hz.
 *
 * @return
 *   Frequency in Hz calculated and set by this function. Users can use this to
 *   compare the requested and set values.
 ******************************************************************************/
uint32_t LESENSE_ScanFreqSet(uint32_t refFreq, uint32_t const scanFreq)
{
  uint32_t tmp;
  uint32_t pcPresc = 0UL;  /* Period counter prescaler. */
  uint32_t clkDiv  = 1UL;  /* Clock divisor value (2^pcPresc). */
  uint32_t pcTop   = 63UL; /* Period counter top value (max. 63). */
  uint32_t calcScanFreq;   /* Variable for testing the calculation algorithm. */


  /* If refFreq is set to 0, the currently configured reference clock is
   * assumed. */
  if (!refFreq)
  {
    refFreq = CMU_ClockFreqGet(cmuClock_LESENSE);
  }

  /* Max. value of pcPresc is 128, thus using reference frequency less than
   * 33554431Hz (33.554431MHz), the frequency calculation in the while loop
   * below will not overflow. */
  EFM_ASSERT(refFreq < ((uint32_t)UINT32_MAX / 128UL));

